Repository: klausgreiner/aurora_assessment
Catalog: lib/core/l10n/app_*.arb
Languages: de

# appTitle
source: Random Image
de: Zufälliges Bild

# buttonAnother
source: Another
de: Weiteres

# instructionTapAnother
source: Tap 'Another' for a new image
de: Tippen Sie auf 'Weiteres' für ein neues Bild

# semanticsImageLoadMessage
source: Image load message
de: Bildladungsnachricht

# semanticsLoadAnotherImage
source: Load another random image
de: Weiteres zufälliges Bild laden

# errorFailedToLoadInitialImage
source: Failed to load initial image
de: Fehler beim Laden des ersten Bildes

# buttonRetry
source: Retry
de: Wiederholen

# errorCouldNotLoadImage
source: Could not load that image. Try again.
de: Bild konnte nicht geladen werden. Bitte erneut versuchen.

# errorCouldNotExtractColors
source: Could not extract colors from image. Try again.
de: Farben konnten nicht aus dem Bild extrahiert werden. Bitte erneut versuchen.

# errorImageNotFound
source: Image not found. Please retry.
de: Bild nicht gefunden. Bitte erneut versuchen.

# errorAccessDenied
source: Access denied (403). Cannot load this image.
de: Zugriff verweigert (403). Dieses Bild kann nicht geladen werden.

# errorServerError
source: Server error. Please try again.
de: Serverfehler. Bitte erneut versuchen.

# errorImageLoadTimeout
source: Image load timed out. Please try again.
de: Bildladung abgelaufen. Bitte erneut versuchen.

# errorNetworkError
source: Network error. Please check your connection.
de: Netzwerkfehler. Bitte überprüfen Sie Ihre Verbindung.

# errorFailedToLoadImage
source: Failed to load image. Please try again.
de: Bild konnte nicht geladen werden. Bitte erneut versuchen.

# errorImageLoadTimeoutAfterSeconds
source: Image load timed out after 3 seconds
de: Bildladung nach 3 Sekunden abgelaufen

# errorRequestTimeout
source: Request timed out. Please try again.
de: Anfrage abgelaufen. Bitte erneut versuchen.

# errorConnectionError
source: Connection error. Please check your internet.
de: Verbindungsfehler. Bitte überprüfen Sie Ihr Internet.
